/******************************************************************************

Copyright (c) [2018 - 2019] MOMENTA Incorporated. All rights reserved.

******************************************************************************/


/*******************************************************************************
 *  INCLUDE FILES
 *******************************************************************************/
#include "hal_version.h"
#include <stdio.h>

/*******************************************************************************
 *  函数名：hal_get_version
 *  描述：HAL 获取libhal.a verison num
 *  输入：无
 *  输出：无
 *  返回：无
 *  备注：无
 *******************************************************************************/
void hal_get_version(void)
{
	printf("SDK%d.%d HAL V%d.%d.%d\n",HAL_VSDK_MAJOR, HAL_VSDK_MINOR, HAL_VERSION_MAJOR, HAL_VERSION_MINOR, HAL_VERSION_END);
}
