/******************************************************************************

Copyright (c) [2018 - 2019] MOMENTA Incorporated. All rights reserved.

******************************************************************************/


/*******************************************************************************
 *
 * 文件: hal_arch.h
 *
 * 描述: 该文件提供HAL ARCH模块的接口函数
 *
 ******************************************************************************/

#ifndef __HAL_ARCH_H__
#define __HAL_ARCH_H__

#ifdef __cplusplus
extern "C" {
#endif // __cplusplus


/*******************************************************************************
*  DEFINES
*  描述：The return status of the HAL ARCH API.
*******************************************************************************/
#define HAL_ARCH_OK              (0)
#define HAL_ARCH_EFAIL           (-1)
#define HAL_ARCH_ETIMEOUT        (-2)
#define HAL_ARCH_EALLOC          (-3)
#define HAL_ARCH_EBUSY           (-4)
#define HAL_ARCH_EINVALID_PARAMS (-5)


/*******************************************************************************
 *  函数名：hal_arch_init
 *  描述：系统hal层申请资源以及配置初始化参数
 *  输入：无
 *  输出：无
 *  返回：0 表示关闭系统arch资源成功，小于零表示失败
 *  备注：HAL 层初始化工作第一个调用的接口
 *******************************************************************************/
int hal_arch_init(void);


/*******************************************************************************
 *  函数名：hal_arch_deinit
 *  描述：系统hal层关闭时释放初始化申请的资源
 *  输入：无
 *  输出：无
 *  返回：0 表示关闭系统arch资源成功，小于零表示失败
 *  备注：一定要和hal_arch_init配套使用
 *******************************************************************************/
int hal_arch_deinit(void);

#ifdef __cplusplus
}
#endif // __cplusplus

#endif //__HAL_ARCH_H__

